int/resources/objectRepo/xmlTemplates/opera/ResourceConfigService/req_CreateInventoryItems.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateInventoryItemsRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Items>
            <v91:Item UsedForEvents="?" UsedForReservation="?">
               <v91:HotelCode/>
               <v91:ItemID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
               <v91:ItemClassID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
               <v91:ItemClassCode/>
               <v91:ItemClassDescription/>
               <v91:ItemName/>
               <v91:ItemDescription/>
               <v91:ItemCode/>
               <v91:RevenueType/>
               <v91:RevenueTypeEditable/>
               <v91:ExternalOrder/>
               <v91:Print/>
               <v91:SellInfo>
                  <v91:Available>
                     <v91:StartDateTime/>
                     <v91:EndDateTime/>
                  </v91:Available>
                  <v91:QtyInStock/>
                  <v91:DefaultQty/>
                  <v91:SellSeparate/>
                  <v91:SellControl/>
                  <v91:WelcomeOffer/>
                  <v91:WebBookable/>
                  <v91:ItemClassWebBookable/>
                  <v91:OutsideStay/>
                  <v91:FixedCharge/>
                  <v91:Discountable/>
                  <v91:ItemClassDiscountable/>
                  <v91:CriticalInventory/>
                  <v91:Price Amount="?" CurrencyCode="?"/>
                  <v91:DefaultDuration/>
               </v91:SellInfo>
               <v91:SetupTime/>
               <v91:SetdownTime/>
               <v91:TraceText/>
               <v91:ItemPool/>
               <v91:DisplaySequence/>
               <v91:EventTypes>
                  <v91:Code/>
               </v91:EventTypes>
               <v91:Departments>
                  <v91:Code/>
               </v91:Departments>
               <v91:Attributes>
                  <v91:Attribute>
                     <v91:ItemAttributeID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                     <v91:Name/>
                     <v91:SetupTime/>
                     <v91:SetdownTime/>
                     <v91:Default/>
                  </v91:Attribute>
               </v91:Attributes>
               <v91:Rates>
                  <v91:Rate>
                     <v91:ItemRateID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                     <v91:ItemRateCode/>
                     <v91:Name/>
                     <v91:Price Amount="?" CurrencyCode="?"/>
                     <v91:Hourly/>
                     <v91:Default/>
                  </v91:Rate>
               </v91:Rates>
               <v91:Vendors>
                  <v91:Vendor>
                     <v91:ProfileID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                     <v91:Name/>
                     <v91:LeadTime/>
                     <v91:Price Amount="?" CurrencyCode="?"/>
                     <v91:Priority/>
                     <v91:Phone/>
                     <v91:Fax/>
                     <v91:Email/>
                  </v91:Vendor>
               </v91:Vendors>
            </v91:Item>
         </v9:Items>
      </v9:CreateInventoryItemsRQ>
   </soapenv:Body>
</soapenv:Envelope>